{
	"Character Names": ["AgathaVanguard", "AgathaVan"],
	
	"InputOutput": {
		"z1, zz0":	[
			"fall in! With me!",
			"over here! Follow me!",
			"to me, I will lead!",
			"to me!",
			"hey! Follow me!",
			"we all need to go together! Let's go!",
			"I can't do this alone, come with me!",
			"follow me! This way!",
			"you! With me!"
			],
		"z2, zz9":	[
			"don't just stand there, let's go!",
			"keep moving, let's go!",
			"keep moving!",
			"keep up the pressure! Don't tarry!",
			"keep it up! Attack!",
			"we must progress!",
			"no time to rest! We must press the attack!",
			"keep pushing! Fight on!"
			],
		"z3, zz8":	[
			"bugger it all! Fall back!",
			"retreat men!",
			"r̃un for you lives!",
			"retreat!",
			"fall back while you can!",
			"fall back!",
			"the battle goes against us! Fall back!",
			"noooo! Fall back!"
			],
		"z4, zz7, killthearchers":	[
			"their archers are over there!",
			"stop those worthelss archers!",
			"archers! Take them out!",
			"kill those craven archers, in disgust!",
			"we can't stand there and let them loose those arrows!",
			"oOoOoH, the bravery of being out of range... kill the archers!",
			"KILL THE ARCHERS!",
			"they're ranging us! Stop 'em!"
			],
		"z5, zz6":	[
			"hold the village and defend the peasants!",
			"men we need to defend the innocent! For Agatha and her people!",
			"don't let those mongrels reach the villagers!",
			"defend the village!",
			"the Masons are storming the village! Protect it!",
			"stop that battering ram!",
			"men, keep the Masons from pushing the ram!",
			"don't let them bring that ram to our gate!",
			"fight them off of the battering ram!",
			"stop the ram! Don't let them any closer!",
			"they've come here to kill the king! Stop them!",
			"hold the throne room! Don't let them in!",
			"our lives mean nothing if the king dies!",
			"guard the king with your lives!",

			"keep those dirty mongrels away from the valley!",
			"don't let the order get any closer! They must be stopped!",
			"keep them at bay men! They mean some foul deed!",
			"stop the masons from getting any closer!",
			"they mustn't enter the valley! stop that cart!",
			"stop that cart men! Don't let them dump those bodies in our water!",
			"they're trying to poison us! Stop that cart!",
			"don't let them poison our aquifer!",
			"men! We need to keep that cart out of the cistern",
			"they're trying to poison us! Keep that cart away!",
			"protect both cranks men! And defend the seluce!",
			"hold back the water and defend the seluce!",
			"keep the seluce gates closed men! And defend the cranks!",
			"we need to stop the Masons from releasing those foul waters!",
			"defend the cranks!",
			"fight them off the cranks! They're trying to release the water!",
			"they're coming for our nobles! Defend them at all costs!",
			"guard Argon's kin! The Masons mean to murder them!",
			"the King's family is in danger! Protect them!",
			"they're coming for the royal family! Stop them!",
			"we can't let them get to the royal family!",

			"we're blocked at the barricade! Use the ballistas to tear it down!",
			"take their ballistas and destroy the barricade!",
			"capture their ballistas and fire on the wall!",
			"we need to take that wall down! Take the ballistas!",
			"we're blocked at the barricade men! Use their ballistas!",
			"free the slaves! Break their chains!",
			"free the slaves!",
			"we must free our people!",
			"we can't leave them to this fate! Break the chains!",
			"kill the traitor! Kill Malric!",
			"storm the citadel men! And kill the so-called King!",
			"the end of the rebellion is in sight! Kill Malric!",
			"to the citadel! Repay the lord of traitors with death!",
			"the r̃ebellion ends when Malric's head rolls!",

			"light the fires! The ships are waiting!",
			"that signal fire won't light itself!",
			"we need to blow that wall! Signal them with fire!",
			"we must signal our ships and light the fire!",
			"light the fires our ships are waiting for our signal!",
			"signal the ships with fire!",
			"now men! The enemy trebuchets need to be taken out!",
			"don't let them sink our ships! Destroy their weapons of siege!",
			"our ships are sitting ducks out there! We must destroy the trebuchets!",
			"tear down their trebuchets!",
			"we need to take out our enemy ships! Use the ballistas against them!",
			"on the wall! Use the ballistas against their ships!",
			"use the ballistas against them! Get up on the wall!",
			"men we must turn the tide of the sea battle! Take over the enemy's ballistas!",
			"take over the enemy's ballistas! We need to support our ships!",

			"torches! We need to burn this farm to the ground!",
			"torch this farm!",
			"don't you think this farm should be burning?",
			"men, we must burn this farm!",
			"let's make ashes out of this farm! Burn it nooooooooow!",
			"men! Take it to the walls! Keep pushing!",
			"bring the cart to the gate!",
			"keep the Masons off the cart!",
			"don't just stand there! Push that cart!",
			"take that cart to their gates!",

			"go forth and take the red and black! Bring it back!",
			"the Masons have taken claim to our city! Strike down their banner!",
			"disgrace the Masons by capturing their colors!",
			"we can't allow the Masons to fly their treasonous flag! Take it!",
			"oh no! They've taken our banner! Bring it back!",
			"they've disgraced us by capturing our colors! Retrieve them!",
			"those Mason pigs have taken our banner! Retrieve it!",
			"those low-life lollybangers have captured our sigil! Hunt them down like dogs!"
			],
		"z6, zz5":	[
			"we stay here!",
			"we stay and fight here!",
			"hold! Hold!",
			"don't move! We hold here!",
			"we fight them here!",
			"we hold them off here!",
			"men, stay here! We need to hold this ground!",
			"where are you going! We need to hold here!"
			],
		"z7, zz4":	[
			"cover me! Watch my rear!",
			"cover me!",
			"defend me!",
			"to me! Be my shield!",
			"defend me! Watch my back!",
			"keep an eye on me!",
			"keep me covered!",
			"keep them off of me!"
			],
		"z8, zz3":	[
			"they're coming!",
			"the Masons! They come!",
			"be at the r̃eady! The Masons are here!",
			"finally! Here comes the fight!",
			"the battle approaches!",
			"be on guard! Here comes the fight men!",
			"men, unsheath your swords. The fight approaches!",
			"here they come!",
			"chin up, men! The Order is here!",
			"fight, men! Fight! The time is now!"
			],
		"z9, zz2":	[
			"turn around! They've flanked us",
			"look alive! They're cr̃eeping up from behind!",
			"those skulkers are taking our rear!",
			"men, about face!",
			"behind us!",
			"men, from behind! They're approaching!",
			"they've circled around us!",
			"they're encroaching on our... rear."
			],
		"z0, zz1":	[
			"there's nobody here!",
			"they're all gone!",
			"the cowards, they've deserted!",
			"nothing stirs here but wind-blown leaves!",
			"they've fled! Those chicken hearts!",
			"ah, they must be hiding, those gutless lollybangers!",
			"come out, come out, wherever you are..."
			],
		"x1, xx0": 	[
			"yeeesss!",
			"I whole-heartedly agree!",
			"alright!",
			"yes!",
			"aye!",
			"yes, milord.",
			"alright, yes ...milord.",
			"yes, yes, yes.",
			"oh yes.",
			"yes, yes"
			],
		"x2, xx9": 	[
			"no! no!",
			"eugh. No.",
			"No.",
			"I don't think so!",
			"I disagree!",
			"We are in disagreement here.",
			"No!",
			"We find ourselves in disagreement!",
			"There's no way that's going to happen!",
			"Not a chance!",
			"Nay!",
			"Negative!"
			],
		"x3, xx8":	[
			"I need heeeeeelllllp!",
			"help!",
			"I'm going to die I need help!",
			"h-h-h-he-help!",
			"help me please!",
			"don't just stand there, help me!"
			],
		"x4, xx7":	[
			"Never fear! I am here!",
			"I'm coming!",
			"I've got your back!",
			"I've got you!",
			"I'm here to assist!",
			"I'm with you!",
			"I'll be your shield!",
			"I've got you covered!"
			],
		"x5, xx6, thank":	[
			"good looking out!",
			"thank you!",
			"thanks!",
			"I'm in your debt!",
			"I owe you!",
			"oh-hoho, thanks!"
			],
		"x6, xx5":	[
			"you're welcome!",
			"that was a close one!",
			"well, this is what I do",
			"t'was my duty!",
			"I'm honored to help.",
			"It was my honor!"
			],
		"x7, xx4":	[
			"oh no! oh n- uh... I'm so sorry.",
			"oh dear! oh dear... I'm so sorry.",
			"I didn't mean to do that!",
			"oh my lords! I'm so sorry!",
			"oh, excuse me.",
			"my blunder.",
			"oops!",
			"I'm sorry!",
			"well, that didn't pan out right.",
			"oops! That could have come off better!",
			"whoopsadaisy!",
			"oh my!",
			"I do believe that was regretable",
			"gehhhh... that was to be avoided!"
			],
		"x8, xx3, taunt":
			[
			"I was searching for a fool when I found you!",
			"haha! Why you are a man of wax!",
			"hoohoo! I do declare that you're open to incontinence!",
			"I would love to meet thee, but I shall infect my hands!",
			"bless me! What a fry of fornication is upon me!",
			"your kankers swell so much that they would str̃etch the sides of the world!",
			"you are a lump of foul deformity!"
			],
		"x9, xx2, laugh":	[
			"ehhahahehehehauuughh!",
			"*wheeze* ehahahahahaha!",
			"ohhahahaha blasphemy!",
			"hehehe ohohohoo!",
			"hehehahahaaa",
			"ahhahaha!"
			],
		"x0, xx1, respect":	[
			"oh, the training you must have gone through!",
			"a worthy adversary!",
			"I dare say you matched even my own skills!",
			"skilled in the arts of war? You can't all be peasants!",
			"I would knight thee, if you were not a traitor!",
			"you put up quite a fight.",
			"you give me cause to perspire!"
			]
	}


}