{
	"Character Names": ["agathamaa", "agathamanatarms"],

	"InputOutput": {
		"z1, zz0":	[	
			"with me!", 
			"follow me!",
			"come here! I will lead!",
			"fall in!",
			"fall in, with me!",
			"this way! follow me!",
			"follow me! We go this way!"
			],
		"z2, zz9":	[
			"forward!",
			"forward! Keep moving!",
			"keep moving!",
			"press onward!",
			"push them back!",
			"forward! keep up the pressure!",
			"keep moving forward!",
			"press onward!",
			"keep moving!",
			"don't stop now! Onward!",
			"don't stop now!"
			],
		"z3, zz8":	[
			"retreat!",
			"fall back and regroup!",
			"fall back!",
			"fall back to the line!",
			"fall back! Retreat!"
			],
		"z4, zz7, killthearchers":	[
			"mind the archers!",
			"take the fight to those archers!",
			"we're dead in the water until we take out those archers!",
			"the archers! They're cutting us down!",
			"kill those archers!",
			"take out those archers!",
			"the archers! Kill them!"
			],
		"z5, zz6":	[
			"the Masons are coming! Defend the village!",
			"keep the Mason dogs away from the villagers!",
			"the Masons are storming the village! Stop them!",
			"hold the village! Defend the peasants!",
			"the Masons, they're coming! Defend the village!",
			"hold the village, in the name of the king!",
			"stop the battering ram! Don't let it get any closer!",
			"they're bringing that ram to our walls! Stop it!",
			"they're trying to break into the keep! Stop the ram!",
			"keep the Masons off the ram! Fight them off!",
			"we can't allow them to bring the ram to our gate!",
			"we must defend the king!",
			"raise your swords in defense of the king!",
			"the Masons are coming! Hold the throne room!",
			"they're trying to kill our king! Save him!",
			"the Masons mean to murder our king! Stop them!",
			"defend the king! Hold the throne room!",
			
			"they mean some foul deed, stop the Masons!",
			"I don't like the looks of that cart, stop it!",
			"don't let them bring that cart any closer!",
			"the Masons, they're trying to enter the valley! Stop them!",
			"the Masons are approaching the valley! Stop them!",
			"protect the cistern! Keep them out of our waters",
			"they're trying to poison our people! Keep that cart out of the aquifer!",
			"keep the Masons out of the aquifer!",
			"we must stand firm at the cistern! Stop that cart!",
			"they mean to befoul our waters! Stop the masons! Stop them at the cistern!",
			"hold them at the sluice gate cranks!",
			"we cannot let them empty the cistern into the river! Stop them at the sluice gate cranks!",
			"keep that sluice gate shut! Keep them off the cranks!",
			"the mean to release the disease into our rivers! Stop them! Hold them at the cranks!",
			"we must defend the nobles at all costs!",
			"defend our lord's family with your lives",
			"they mean to murder our high-born! Stop them! Protect the family!",
			"hold fast at the fort! They're trying to kill our nobles!",
			"keep those Mason mongrels away from the high-born!",
			
			"turn their ballistas on their own barricade!",
			"we must break through the barricade! Use their ballistas!",
			"we can't continue until we take that wall down! Use the ballistas!",
			"fire their ballistas upon their own barricade!",
			"we must use their ballistas against them! Fire them upon the barricade!",
			"we must free the slaves and stop their forges!",
			"there, the slaves! Break their chains!",
			"we can't leave these slaves here to this lot! Free them!",
			"we must bring freedom to our people! Free the slaves!",
			"quickly, free the slaves and cease their forges!",
			"raid the citadel and kill the false king!",
			"charge the citadel! Death to the usurper!",
			"they cower in the citadel! Kill them! Kill them all!",
			"we end this war now! Kill the false king!",
			"we're not finished until we have Malric's head!",
			
			"our ships await the signal! grab a torch and light the pire!",
			"we blow through that wall! Signal the ships with fire!",
			"find torches, light the pire! Our ships need to know it's time!",
			"our ships lie in wait! Find a torch and light the pire!",
			"we must signal our ships with fire! Find a torch!",
			"our ships are in danger! Destroy those trebuchets!",
			"the trebuchets are devastating our navy! Destroy them!",
			"we can't let them sink our ships! Destroy the trebuchets!",
			"we must take out the enemy trebuchets, now!",
			"they're sinking our ships! Destroy the trebuchets!",
			"support our ships! There, on the wall! Use the ballistas!",
			"climb the wall! Man the ballistas, use them agains their own ships!",
			"there, on the wall, the ballistas! Turn them agains their boats",
			"we must win this sea battle, use their ballistas against them!",
			"capture the enemy ballistas, fire upon their boats!",
			
			"burn the farm! Burn it to the ground!",
			"find torches, torch the farm!",
			"find a torch, set fire to the farm!",
			"we must burn the farm! Find torches!",
			"we must destroy the farm! Find torches and burn it!",
			"find fire and torch the farm!",
			"the cart! Take it to the gate!",
			"keep them off the cart! Push it to the gate!",
			"keep that cart moving, we need to bring it to their gate",
			"we must blow open that gate! Push the cart forward!",
			"we must breach their walls! Push the petard to the gate!",
			
			"go forth and bring back the Mason banner!",
			"disgrace the Masons, take their flag!",
			"go and take the Mason colors! Strike them down!",
			"strike down the banner of the traitors, bring it back!",
			"Agatha holds this city, take their flag!",
			"hurry, we must bring back our banner!",
			"those treasonous dogs have taken our flag! Return it, now!",
			"the Order have taken our banner! Bring it back",
			"they have our flag! Retrieve our honor!",
			"those dogs have our colors! Retrieve our banners!"
			],
		"z6, zz5":	[
			"hold!",
			"hold your ground men!",
			"here! hold here!",
			"stay to this spot! We must hold this ground!",
			"stay here, we hold them here!",
			"here we make our stand!",
			"we must defend this ground with our lives!",
			"we hold them here!",
			"keep them at bay here! Hold your ground!",
			"hold this ground!",
			"stay fast here, men!"
			],
		"z7, zz4":	[
			"defend me!",
			"I need protection!",
			"defend me, I can't do it on my own!",
			"defend me men, this is important!",
			"to me, brothers! To me!",
			"lend me your shields!",
			"to me! I need your support!",
			"watch my back!",
			"keep me covered lads!",
			"keep me covered!",
			"watch my back!"
			],
		"z8, zz3":	[
			"here they come!",
			"mind you, they bring the fight to us!",
			"they're coming right for us!",
			"***they're comin right for us***!",
			"they bring the fight to us!",
			"incoooooming!",
			"here they come!",
			"ready yourselves, here they come!",
			"here they come lads, the fight is now!",
			"this is the moment we've been waiting for, fight!",
			"steel yourselves, brothers! Here they come!"
			],
		"z9, zz2":	[
			"about face! They're behind us!",
			"behind us! They're behind us!",
			"somehow, they've gone around our flank!",
			"about face, men, they're behind us!",
			"watch your arses men, they come from behind!",
			"watch your back, they are behind us!",
			"they've flanked us men!",
			"keep your head on a swivel! They've gone behind us!",
			"they come from our sides!",
			"watch your asses men!"
			],
		"z0, zz1":	[
			"looks all clear to me!",
			"none of those cowards in sight!",
			"empty, there's no one here!",
			"I've seen here nor there of them!",
			"all clear!",
			"there's no one left to fight here!",
			"this place is empty!",
			"it's all clear, my lord!",
			"nobody stirs here!",
			"they've deserted, there's nobody here!",
			"they're not to be found!",
			"it's all clear men!"
			],
		
		"x1, xx0": 	[
			"aye!",
			"yes!",
			"I agree!",
			"yes, sir!",
			"affirmative!"
			],
		"x2, xx9": 	[
			"no!",
			"no way!",
			"**no**!",
			"tis folly!",
			"no.",
			"no, sir!",
			"nnnnnnegative!",
			"nay!",
			"***no!***",
			"not!",
			"nnnnnot!",
			"are you out of your mind!?",
			"it can't be done!"
			],
		"x3, xx8":	[
			"hel-help!",
			"help!",
			"help me!",
			"help me! **Help!**",
			"help! I need help!"
			],
		"x4, xx7":	[
			"I'm with you brother!",
			"at your service, my lord!",
			"I'm with you, lad!",
			"I've got your back!",
			"I'm with you!",
			"you have my arms, my lord!",
			"I've got you covered!",
			"go on, I'll watch over you!",
			"I'll stay close to you!",
			"I'll stay close by your side!",
			"I'll stick with you!",
			"I'll keep an eye on you!"
			],
		"x5, xx6, thank":	[
			"thank you!",
			"thanks!",
			"thanks, my brother!",
			"I owe you!",
			"thanks for your aid!"
			],
		"x6, xx5":	[
			"you're welcome!",
			"think nothing of it!",
			"never you mind!",
			"'twas my pleasure, brother!",
			"you're welcome!",
			"any time, lad!",
			"any time, brother!",
			"forget about it!",
			"'twas my duty!",
			"you're welcome, sir!",
			"'twas my pleasure!",
			"glad to be of help!"
			],
		"x7, xx4":	[
			"uh... I wasn't thinking!",
			"sorry!",
			"ho ho, oops!",
			"I didn't mean it!",
			"Oh... I thought you were somebody else!",
			"Oh! The blue looked red!",
			"Agh! Uh... the red looked blue!",
			"woah ho ho ho... oops!",
			"my bad!",
			"I didn't do it",
			"it wasn't me!",
			"oh my! Sorry.",
			"my bad! ...oh my god.",
			"what have I done?!",
			"heads up!"
			],
		"x8, xx3, taunt":	[
			"it's a fine peasant rebellion you've got here!",
            		"you call that a coat of arms?",
            		"after I've run you through, next is your mother!",
            		"you smell like a woman!",
            		"oh, I've had sheep that put up more fight than you!",
            		"your sword looks a little short, if you know what I mean!",
            		"show me your backside, 'tis your best side!",
			"oh, would appear the peasants have risen up and found swords!",
			"it's a fine peasant rebellion you've got here!"
			],
		"x9, xx2, laugh":	[
			"ha ha ha ha! hahaha!",
			"hehehehee!",
			"hohoho! Yesyesyes!",
			"heheHahahaha!",
			"he ha ha! You've gotta be kiddin me!",
			"wha ha ha ha ha ha!",
			"hohohohohahahahahaha!",
			"ho ho ho, oh yes!"
			],
		"x0, xx1, respect":	[
			"best fight I've ever had.",
            		"ah, finally met my match.",
            		"I've heard of you!",
            		"grand so, good fight.",
            		"I've never seen such skill in battle!",
            		"you did your family honor, die with dignity.",
            		"a worthy aversary.",
           		"unbelievable resistance, incredible.",
           		"never have I been matched so!",
           		"finally a fight to match my own!",
           		"I've never seen such skill in battle, may I never see it again!"
			]
	}


}