{
	"Character Names": ["MasonMAA", "MasonManAtArms"],

	"InputOutput": {
		"z1, zz0":	[
			"with me! Into the breach!",
			"let's go! Follow me!",
			"come! Follow me!",
			"come with me, this way!",
			"with me, we go this way!",
			"follow me!"
			],
		"z2, zz9":	[
			"forward!",
			"onward!",
			"go! Go! Go!",
			"press onward!",
			"no time to tarry! Move!",
			"keep going! Press the attack!",
			"keep going!"
			],
		"z3, zz8":	[
			"fall back!",
			"it's no use! Retreat!",
			"fall back, while you still can!",
			"this is not good! Let's get out of here!",
			"let's get out of here!",
			"fall back and live to fight another day!",
			"this fight goes poorly! Retreat!",
			"retreat! Retreat!"
			],
		"z4, zz7, killthearchers":	[
			"kill those annoying archers!",
			"slay the irritating archers!",
			"be warned! They have archers!",
			"be warry of their bowmen!",
			"kill the archers first!",
			"look out! Archers!",
			"slay the irritating archers!",
			"those archers must be stopped!",
			"put an end to those archers!"
			],
		"z5, zz6":	[
			"storm the village! Leave no one alive!",
			"slay the peasants, and burn the village!",
			"burn the village! I want to see ashes rain from the skies!",
			"torch the village, and kill anything that moves!",
			"take the village, in the name of the order!",
			"stay to the ram! Keep it moving!",
			"keep these Agathian whelps off of the ram!",
			"take the ram to the wall! Batter their gates!",
			"they're not going to let us in. Move the ram!",
			"take the ram to the wall! Smash the door in!",
			"to the throne room! Death to the pretender!",
			"rush the keep, and kill the steward!",
			"into the throne room! If they won't bend the knee, they lose their heads!",
			"storm the castle, and kill the so-called king!",
			"victory is near! Kill the steward in the name of Malric!",

			"move the cart into the valley!",
			"keep the cart moving! We have much further to go!",
			"do not let them stop the cart!",
			"we need to bring the cart into the valley",
			"keep the Agathians away from the cart!",
			"bring the corpse wagon into the cistern!",
			"keep the cart moving, straight into the aquifer!",
			"bring the cart into the aquifer, we must disease their waters!",
			"push the diseased wagon into the cistern!",
			"keep the wagon rolling! We must push these diseased bodies into the cistern!",
			"we must open the seluce! Fight your way to the cranks!",
			"to throw open the seluce, we must get a man on both cranks!",
			"fight your way to the cranks and release these foul waters!",
			"quickly, get to the seluce gate cranks!",
			"to release the disease, we must fight our way to the seluce gate cranks!",
			"what luck! There are royal family here! Find them and kill them!",
			"their nobles are hiding in the fort! Kill them!",
			"search the fort for their nobles and bring them death!",
			"we are not leaving until all of the royals here are dead!",
			"there are Agathian highborn cowering in the fort! Find them and kill them all!",

			"they're trying to use our ballistas! Keep them off the walls!",
			"keep them away from the ballistas!",
			"keep the Agathians off of our walls!",
			"hold the ballistas! Keep the agathians away!",
			"don't let the Agathians use the ballistas on our barricade!",
			"the Agathians are freeing the slaves! Stop them!",
			"do not let them free the slaves! Fight them away from the forges!",
			"keep those slaves in chains!",
			"do not let them free the slaves! I fear a riot!",
			"they are freeing the forge workers from their bondage!",
			"keep them out of the citadel! Protect Malric!",
			"do not let them get any closer to our king!",
			"they are entering the citadel! Defend Malric!",
			"they are trying to kill the king! Stop them!",
			"do not let them touch Malric! Protect the king!",

			"the Agathians have landed on our shores! Keep them away from the wall!",
			"they're trying to signal their ships! Keep them away from the torches!",
			"they're trying to light a signal fire! Keep them away from the torches!",
			"they mean to send a signal to their boats! Keep them away from the pire!",
			"they want to signal their ships! Keep them away from fire!",
			"defend the trebuchets! We need them to keep their boats at bay!",
			"protect the trebuchets! They're trying to destroy them!",
			"keep those trebuchets upright! We need them firing upon their ships!",
			"they are sabotaging our trebuchets! Defend them!",
			"do not let them tear down our trebuchets!",
			"they are coming for our ballistas! Defend them!",
			"fight them off of our ballistas!",
			"they are using our ballistas on our ships! Stop them!",
			"keep them from using the ballistas on our ships!",
			"don't let them use our ballistas on our ships!",
			
			"protect the farm! Don't let them get to the torches!",
			"keep the Agathians away from the farm",
			"they're trying to put the torch to the farm! Stop them",
			"defend the farm! Don't let them burn it!",
			"they're buring the farm! Keep them away from the torches!",
			"stop the petard! If they get that to our walls we're as good as dead!",
			"keep the Agathians off that cart!",
			"the petard is the key to victory! Stop it!",
			"the fight is at the cart, do not let them move it!",

			"show them who is in control of this town! Strike down their flag and bring it back!",
			"disgrace them by taking their banner!",
			"go and find their flag! Bring it back for the order!",
			"find the flag of the lion! Strike it down and bring it back!",
			"this is the territory of The Mason Order! Take their flag down!",
			"the Agathians have our banner! Bring it back!",
			"they have taken our colors! Retrieve them!",
			"they've taken the red and black! Return our banner!",
			"hurry, they have our flag! Bring it back!",
			"they have stolen our banner! Do not let them get away!"
			],
		"z6, zz5":	[
			"stay to this spot!",
			"hold this ground! Don't give them an inch!",
			"here! We stay them here!",
			"here! We fight here!",
			"hold this ground!",
			"stay! Stay here! We hold here!",
			"we fight them here!"
			],
		"z7, zz4":	[
			"to me! Defend me!",
			"hurry! Protect me!",
			"cover me",
			"here! defend me!",
			"to me! defend me!",
			"protect me!",
			"defend me! Watch my back!",
			"cover me! Watch my flanks!"
			],
		"z8, zz3":	[
			"incoming!",
			"here they come!",
			"steel yourselves, they come!",
			"steel yourselves, they're coming!",
			"be ready, the battle approaches!",
			"ah! Here come the boys in blue!",
			"look alive, here comes the fight!",
			"be on guard, they're coming!"
			],
		"z9, zz2":	[
			"they've gotten behind us!",
			"they're attacking from the rear!",
			"they've flanked us!",
			"they've gotten behind us!",
			"turn around, they're behind you!",
			"they're behind us!",
			"about face, they're attacking from the rear!",
			"they are coming up on our rear flank!",
			"they are striking from our rear flank!"
			],
		"z0, zz1":	[
			"it's all clear!",
			"there's nobody here!",
			"not a man standing!",
			"there's nobody here to fight!",
			"the Agathians are all gone!",
			"this place is empty!",
			"it's all clear, there's nobody here!",
			"there's noone here!",
			"the Agathians have all fled!"
			],
		"x1, xx0": 	[
			"yes!",
			"aye!",
			"alright!",
			"okay!",
			"yis!",
			"yes, sir!",
			"of course!",
			"okay, then!",
			"I agree!",
			"we are in agreement!",
			"correct!"
			],
		"x2, xx9": 	[
			"no!",
			"no.",
			"no way!",
			"nnnope!",
			"negative!",
			"I think not!",
			"no, sir!",
			"never!",
			"nope."
			],
		"x3, xx8":	[
			"help! help me!",
			"oh help! help!",
			"help! h-help!",
			"h-h-h-help!",
			"oh help!",
			"I need help!"
			],
		"x4, xx7":	[
			"I've got your back!",
			"I will stand by you!",
			"you and me, together!",
			"I'm here!",
			"I'm with you!",
			"I'll be here with you!",
			"together! Let's go!"
			],
		"x5, xx6, thank":	[
			"thanks!",
			"oh! Thanks!",
			"wow! Thank you!",
			"I am in your debt!",
			"I owe you!",
			"you have done me a great favor!",
			"I owe you one!",
			"I owe you!",
			"thank you!"
			],
		"x6, xx5":	[
			"you are welcome!",
			"you're welcome!",
			"think nothing of it!",
			"pulled your feet from the fire, did I?",
			"you owe me one!",
			"you are very welcome!",
			"I did you a favor!"
			],
		"x7, xx4":	[
			"oh! Sorry!",
			"ho! oh, sorry!",
			"I'm so sorry!",
			"ah! It was an accident!",
			"I do apologize!",
			"my apologies!",
			"oh! My bad!",
			"ah, it was an accident!"
			],
		"x8, xx3, taunt":
			[
			"you scullion! I'll tickle your catastrophe!",
			"your wife is a hobby horse!",
			"there's no more fight in thee than in a stewed prune!",
			"your stupidity is no accident, it is your birthright!",
			"you are pigeon livered, and you lack any gall!",
			"your virginity breeds mites! Much like a cheese!",
			"you should be women, and yet your beards forbid me to interpret that you are so!",
			"your brain is as dry as a biscuit after a long voyage!"
			],
		"x9, xx2, laugh":	[
			"ehhehehe yes! yes...",
			"haha hahahahahehehe",
			"hehehehehehheehehuehueheuhaha!",
			"aahhhhhahahahahahahahahue!",
			"yes! hahaha!",
			"hahaha! hahahahaha!",
			"euhehehehhhehe!",
			"ehehehahahehehehaha!",
			"aaahhhhahahahahahahahaha!",
			"ohehehahahahhaheha!"
			],
		"x0, xx1, respect":	[
			"honored, to cross swords with you!",
			"ah! A formidible foe!",
			"it's about time I ran into somebody who could fight!",
			"finally, a challenge!",
			"and I was beginning to think that none of these loyalists could fight!",
			"finally, a fighter! I was beginning to think you were all squires!",
			"honored, to fight one of such skill!",
			"you put up quite a fight!"
			]
	}




}